# Core Infrastructure Tools
brew "terraform"
brew "awscli"
brew "kubectl"
brew "helm"
brew "jq"
brew "yq"

# Kubernetes Utilities
brew "eksctl"
brew "k9s"

# Version Control
brew "git"
brew "gh"        # GitHub CLI

# Dev Tooling
brew "direnv"    # Auto-load .env files per directory
brew "pre-commit"
brew "go"        # Required for Terratest

# Testing & Linting
brew "tfsec"     # Terraform static analysis
brew "checkov"   # IaC security scanner
brew "tflint"    # Terraform linter
brew "hadolint"  # Dockerfile linter
brew "shellcheck" # Shell script linter

# Optional UX Tools
brew "fzf"
brew "bat"
brew "tree"
